/**
 * @file:   my_TransFormations.h
 * @note:   2010-2020, <git.oschia.net/think3r>
 * @brief:  my_TransFormations.cpp 的头文件
 * @author: think3r
 * @date:   2020/4/7
 * @note:
 * @note \n History:
   1.日    期: 2020/4/7
     作    者:  think3r
     修改历史: 创建文件
 */

/*----------------------------------------------*/
/*                  头文件包含                  */
/*----------------------------------------------*/

#ifndef __MY_TRANSFORMATIONS_H__
#define __MY_TRANSFORMATIONS_H__

#ifdef __cplusplus
#if __cplusplus
extern "C"{
#endif
#endif /* __cplusplus */
/*----------------------------------------------*/
/*                 宏类型定义                   */
/*----------------------------------------------*/

/*----------------------------------------------*/
/*                结构体定义                    */
/*----------------------------------------------*/

/*----------------------------------------------*/
/*                 函数声明                     */
/*----------------------------------------------*/
float * transFormations_get1(uint32_t u32NowTime);
float * transFormations_get2(uint32_t u32NowTime);

/*----------------------------------------------*/
/*                 全局变量                     */
/*----------------------------------------------*/

/*----------------------------------------------*/
/*                 函数定义                     */
/*----------------------------------------------*/


#ifdef __cplusplus
#if __cplusplus
}
#endif
#endif /* __cplusplus */


#endif /* __MY_TRANSFORMATIONS_H__ */
